app/views/statuses/_status.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."status_id" = 11
SELECT COUNT(*) FROM "comments" WHERE "comments"."status_id" = 11
---
</div>
<%= link_to pluralize(status.comments.count, 'comment'), "#", class: 'comments' %>