app/views/statuses/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."status_id" = 11
---
</div>
<%= link_to pluralize(@comments.count, 'comment'), "#", class: 'comments' %>