app/views/home/index.html.erb

				<% end %>
				<%= render current_user.statuses.where("id IS NOT NULL").reverse %>
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."user_id" = 11 AND (id IS NOT NULL)