app/controllers/comments_controller.rb

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "12"]]
INSERT INTO "comments" ("content", "created_at", "status_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "comment 2"], ["created_at", Tue, 30 Dec 2014 12:17:25 IST +05:30], ["status_id", 12], ["updated_at", Tue, 30 Dec 2014 12:17:25 IST +05:30], ["user_id", 4]]
---
	def create
		@status = Status.find(params[:comment][:status_id])
		@comment = Comment.new(params[:comment])
		@comment.user = current_user
		@comment.save