app/controllers/home_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."owner_id" IN (7, 8) AND "activities"."owner_type" = 'User'
---
	def index
		if user_signed_in?
			if (current_user.id==1)
			redirect_to admin_allusers_user_path
			end
			@user= current_user
			followees_ids = current_user.followees(User).map(&:id)
			@activities = PublicActivity::Activity.where(owner_id: followees_ids, owner_type: "User")