app/controllers/statuses_controller.rb

	def create
		@status = current_user.statuses.new(params[:status])
		if @status.save
---
INSERT INTO "statuses" ("created_at", "post", "posted_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)

	def show
		 @comment = Comment.new
		@status = Status.find(params[:id])
---
SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "11"]]