app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY fname LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
	def admin_allusers
		if (current_user.id==1)
		@users=  User.paginate(:page => params[:page], :per_page => 5)

SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
---
	def edit
		@user = User.find(params[:format])

SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
---
	def  editprofile
		#@user = User.find(params[:format])
		@user= User.find(params[:format])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@user = User.find(params[:format])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "4"]]
---
	 def follow
		@user = User.find(params[:user])

SELECT "statuses".* FROM "statuses" WHERE "statuses"."id" = ? LIMIT 1  [["id", "12"]]
---
	 def like
		if params[:likeable_type] == "Status"
			@likeable = Status.find(params[:likeable_id])